# Sorting & Ranking in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series(range(5),
            index=["e","d","a","b","c"])
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [3]:
s.sort_index()

a    2
b    3
c    4
d    1
e    0
dtype: int64

In [4]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=["two","one","three"],
    columns=["d","a","b","c"])
df

       d  a   b   c
two    0  1   2   3
one    4  5   6   7
three  8  9  10  11

In [5]:
df.sort_index()

       d  a   b   c
one    4  5   6   7
three  8  9  10  11
two    0  1   2   3

In [6]:
df.sort_index(axis=1)

       a   b   c  d
two    1   2   3  0
one    5   6   7  4
three  9  10  11  8

In [7]:
df.sort_index(axis=1, ascending=False)

       d   c   b  a
two    0   3   2  1
one    4   7   6  5
three  8  11  10  9

In [8]:
s2=pd.Series([5,np.nan,3,-1,9])
s2

0    5.0
1    NaN
2    3.0
3   -1.0
4    9.0
dtype: float64

In [9]:
s2.sort_values()

3   -1.0
2    3.0
0    5.0
4    9.0
1    NaN
dtype: float64

In [14]:
df2=pd.DataFrame(
    {"a":[5,3,-1,9],"b":[1,1,0,5]})
df2

   a  b
0  5  1
1  3  1
2 -1  0
3  9  5

In [24]:
df2.sort_values(by="b").reset_index(inplace = True, drop = True)
df2

   a  b
0  5  1
1  3  1
2 -1  0
3  9  5

In [20]:
df2.sort_values(by=["b","a"],ascending=[False,True])

   a  b
3  9  5
1  3  1
0  5  1
2 -1  0

## Practice

In [ ]:
data=pd.read_csv("Data/vgsalesGlobale.csv")

In [ ]:
data.head()

In [ ]:
data["Name"].sort_values(ascending=False)

In [ ]:
data.sort_values("Name")

In [ ]:
data.sort_values("Year")

In [ ]:
data.sort_values(["Year","Name"])